#include "xlist.h"

int main(void){
	int y=0,m=0,yd=0,md=0,d=0,gre=1;
	char dotw[7][3]={"月","火","水","木","金","土","日"};
	char e[9][120]={
	/*0*/"\n=========================Error========================\n",
	/*1*/"\n=========================警告=========================\n",
	/*2*/"このプログラムでは西暦0年や紀元前を定義していません。",
	/*3*/"月の値に不正な値が入力されました。",
	/*4*/"日の値に不正な値が入力されました。",
	/*5*/"1582年10月5日～1582年10月14日の値が設定されました。\nこの日付は、ユリウス暦からグレゴリオ暦への改定の為、\n存在しません。",
	/*6*/"グレゴリオ暦は約2621年に一日ずれると言われています。\n算出された曜日は参考程度にお考え下さい。",
	/*7*/"\n======================================================\n",
	/*8*/"終了するにはEnterキーを押してください..."};
	printf("曜日計算 v2.00\n");
	
	printf("年数入力 >>>");xscanf(&y);
	if(y<1){//1年未満
		printf("%s%s%s%s",e[0],e[2],e[7],e[8]);
		getchar();return -1;}
		
	printf("月入力   >>>");xscanf(&m);
	if(m<1||m>12){//1月未満,12月超
		printf("%s%s%s%s",e[0],e[3],e[7],e[8]);
		getchar();return -1;}
	
	printf("日付入力 >>>");xscanf(&d);
	
	//グレゴリオ歴フラグ
	if(y<1582){gre=0;}
	else if(y==1582&&m<10){gre=0;}
	else if(y==1582&&m==10&&d<5){gre=0;}
	
	/********************************エラー等の処理********************************/
	if(d<1||d>31){//1日未満31日超
		printf("%s%s%s%s",e[0],e[4],e[7],e[8]);
		getchar();return -1;}
	
	if((m==2||m==4||m==6||m==9||m==11)&&d==31){//31日の無い月
		printf("%s%s%s%s",e[0],e[4],e[7],e[8]);
		getchar();return -1;}
	
	if(y%4!=0&&m==2&&d==29){//閏年でない年の2/29
		printf("%s%s%s%s",e[0],e[4],e[7],e[8]);
		getchar();return -1;}
	
	if(gre==1&&y%100==0&&y%400!=0&&m==2&&d==29){//グレゴリオ暦の閏年でない年の2/29
		printf("%s%s%s%s",e[0],e[4],e[7],e[8]);
		getchar();return -1;}
	
	if(y==1582&&m==10&&d>=5&&d<=14){//暦の改定期間
		printf("%s%s%s%s",e[0],e[5],e[7],e[8]);
		getchar();return -1;}
	
	if(y>=2621){//約2621年に1日ずれる事の警告
		printf("%s%s%s",e[1],e[6],e[7]);}
	/******************************************************************************/
	
	
	
	/**********************************ユリウス暦**********************************/
	if(gre==0){
		yd = (y-1)*365 + (y-1)/4;
		md = (m-1)*31;
		if(m>2){md-=3;
			if(y%4==0){md+=1;}}
		if(m>4){md--;}
		if(m>6){md--;}
		if(m>9){md--;}
		if(m>11){md--;}
		printf("%4d/%2d/%2d\n%s曜日です。\nユリウス暦を使用しています。\n\n%s",y,m,d,dotw[(yd+md+d+4)%7],e[8]);
	}
	/******************************************************************************/
	
	
	
	/*********************************グレゴリオ暦*********************************/
	else{
		yd = (y-1)*365 + (y-1)/4 - (y-1)/100 + (y-1)/400;
		md = (m-1)*31;
		if(m>2){md-=3;
			if(y%4==0){md+=1;}
			if(y%100==0){md-=1;}
			if(y%400==0){md+=1;}}
		if(m>4){md--;}
		if(m>6){md--;}
		if(m>9){md--;}
		if(m>11){md--;}
		printf("%4d/%2d/%2d\n%s曜日です。\nグレゴリオ暦を使用しています。\n\n%s",y,m,d,dotw[(yd+md+d+6)%7],e[8]);
	}
	/******************************************************************************/
	getchar();return 0;}